// --- Визначення глобальних змінних ---

int LDR_Val = 0;      /* Змінна для зберігання сирого значення, зчитаного з фоторезистора */
int sensor = 4;       /* Аналоговий вхід (GPIO 4 на ESP32) для підключення фоторезистора */
int led = 25;         /* Цифровий вихід (GPIO 25) для підключення світлодіода */


void setup() {
  // --- Функція виконується один раз при запуску ---
  
  Serial.begin(9600);     /* Встановлення швидкості обміну даними (9600 бод) для зв'язку з комп'ютером */
  
  // !!! ПОМИЛКА !!! pinMode(led, INPUT); має бути OUTPUT
  // Оскільки ми хочемо керувати світлодіодом, пін має бути налаштований як вихід
  pinMode(led, OUTPUT);   /* Налаштування піна LED як вихід (OUTPUT) */
}


void loop() {
  // --- Функція виконується постійно в циклі ---
  
  LDR_Val = analogRead(sensor); /* Зчитуємо аналогове значення з піна 4. Діапазон значень: 0-4095 */
  
  // --- Виведення даних у Монітор порту ---
  Serial.print("LDR Output Value: ");
  Serial.println(LDR_Val);        /* Відображаємо сире значення LDR на екрані */
  
  // --- Логіка керування світлодіодом ---
  
  if (LDR_Val > 100) {            /* Якщо зчитане значення (інтенсивність світла) є ВИСОКИМ */
    
    Serial.println(" Висока інтенсивність ");
    
    // Світла багато, тому вимикаємо світлодіод
    digitalWrite(led, LOW);       /* Встановлюємо низький рівень (LOW) на пін LED, світлодіод ВИМКНЕНИЙ */
    
  } else {
    
    /* Інакше (якщо світла мало, LDR_Val <= 100) — вмикаємо світлодіод */
    Serial.println("Низька інтенсивність ");
    
    // Світла мало, тому вмикаємо світлодіод
    digitalWrite(led, HIGH);      /* Встановлюємо високий рівень (HIGH) на пін LED, світлодіод УВІМКНЕНИЙ */
  }
  
  delay(1000);                    /* Пауза на 1 секунду перед наступним зчитуванням значення */
}